[Audit - HDSI Template Detected - Rule] #CHANGEME
action.correlationsearch.enabled = 1
action.correlationsearch.label = HDSI HDSI Template Detected #CHANGEME
action.correlationsearch.annotations = {"mitre_attack": ["T1203", "TA0002"]} #CHANGEME
action.customsearchbuilder.enabled = 0
action.customsearchbuilder.spec = {}
action.email = 0
action.notable = 1 # CHANGEME if something is RBA only you can set this to 0. Still add a drilldown though, it can still be used
action.notable.param.drilldown_dashboards = []
action.notable.param.drilldown_searches = [{"name":"View all templates from $src$","search":"`cim_Malware_indexes` tag=malware tag=attack $dest$","earliest_offset":"$info_min_time$","latest_offset":"$info_max_time$"}] #CHANGEME
action.notable.param.rule_description = The $src$ was detected making a template. #CHANGEME
action.notable.param.rule_title = HDSI Template Detected ($src$) #CHANGEME
action.notable.param.security_domain = audit #CHANGEME Values: access, endpoint, network, threat, identity, audit
action.notable.param.severity = medium #CHANGEME default to medium
action.notable.param.verbose = 0
alert.digest_mode = 1
action.risk = 1
action.risk.param._risk_message = Suspicious $process_name$ usage detected on endpoint $dest$ by user $user$.
action.risk.param._risk = [{"risk_object_field": "user", "risk_object_type": "user", "risk_score": 5}, {"risk_object_field": "dest", "risk_object_type": "system", "risk_score": 5}, {"threat_object_field": "process_name", "threat_object_type": "process name"}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
alert.managedBy =
alert.suppress = 1
alert.suppress.fields = src #CHANGEME
alert.suppress.period = 86400s #CHANGEME default 24 hours
alert.track = 1
allow_skew = 5m
counttype = number of events
cron_schedule = */15 * * * * #CHANGEME
description = Your CS description should go here. #CHANGEME
disabled = 0 #Set to 1 to push disabled if needed
dispatch.earliest_time = -20m@m #CHANGEME
dispatch.latest_time = -5m@m
dispatch.rt_backfill = 1
dispatch.ttl = 2p
enableSched = 1
realtime_schedule = 0
relation = greater than
quantity = 0
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
schedule_window = auto
search = `hdsi_template_logs` user="TEMPLATE" src="WS-TEMPLATE" `hdsi_ext_ips(dest_ip)` `hdsi_template_detected_filter` \ #CHANGEME backslash at the end of every line but the last, create `hdsi_template_logs` in the common/macros.conf file to specify index and sourcetype
| stats values(user) by src \
| `hdsi_template_detected_customizations`
